#Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и возводит число
#А в целую степень B с помощью рекурсии.

# num1 = int(input('A: '))
# num2 = int(input('B: '))
#
# c = 1
#
# def degree (a, b, c):
#     if b != 0:
#         c *= a
#         b -= 1
#     else:
#         return c
#     return degree(a, b, c)
#
#
# print(degree(num1, num2, c))






#*Пример:*

#2 2
#4
#** Дополнительно **
#1. Последовательностью Фибоначчи называется последовательность чисел a0, a1, ..., an, ..., где

#a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k > 1).

#Требуется найти N-е число Фибоначчи
